I am using this repository unchanged, and I see this error.

terraform: v0.12.13
Google Cloud SDK: 270.0.0

Full output:

```
var.project_id
  Enter a value: <redacted>

data.google_client_config.current: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_compute_network.default will be created
  + resource "google_compute_network" "default" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + name                            = "mysql-psql-example"
      + project                         = "<redacted>"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.default will be created
  + resource "google_compute_subnetwork" "default" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.127.0.0/20"
      + name                     = "mysql-psql-example"
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = "<redacted>"
      + region                   = "us-central1"
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = (known after apply)
          + flow_sampling        = (known after apply)
          + metadata             = (known after apply)
        }
    }

  # random_id.name will be created
  + resource "random_id" "name" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.mysql-db.google_sql_database.default will be created
  + resource "google_sql_database" "default" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "default"
      + project   = "<redacted>"
      + self_link = (known after apply)
    }

  # module.mysql-db.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_5_6"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = "<redacted>"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = "ALWAYS"
          + authorized_gae_applications = []
          + availability_type           = (known after apply)
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + replication_type            = "SYNCHRONOUS"
          + tier                        = "db-n1-standard-1"
          + version                     = (known after apply)

          + backup_configuration {
              + start_time = (known after apply)
            }

          + database_flags {
              + name  = "log_bin_trust_function_creators"
              + value = "on"
            }

          + ip_configuration {
              + ipv4_enabled = true
              + require_ssl  = true

              + authorized_networks {
                  + name  = "mysql-psql-example"
                  + value = "10.127.0.0/20"
                }
            }

          + location_preference {
              + zone = "us-central1-c"
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "canary"
            }
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.mysql-db.google_sql_user.default will be created
  + resource "google_sql_user" "default" {
      + host     = "%"
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "default"
      + password = (sensitive value)
      + project  = "<redacted>"
    }

  # module.mysql-db.random_id.user-password will be created
  + resource "random_id" "user-password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.postgresql-db.google_sql_database.default will be created
  + resource "google_sql_database" "default" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "default"
      + project   = "<redacted>"
      + self_link = (known after apply)
    }

  # module.postgresql-db.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_9_6"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = "<redacted>"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = "ALWAYS"
          + authorized_gae_applications = []
          + availability_type           = "ZONAL"
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + replication_type            = "SYNCHRONOUS"
          + tier                        = "db-f1-micro"
          + version                     = (known after apply)

          + backup_configuration {
              + start_time = (known after apply)
            }

          + ip_configuration {
              + ipv4_enabled = true
              + require_ssl  = true

              + authorized_networks {
                  + name  = "mysql-psql-example"
                  + value = "10.127.0.0/20"
                }
            }

          + location_preference {
              + zone = "us-central1-c"
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "canary"
            }
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.postgresql-db.google_sql_user.default will be created
  + resource "google_sql_user" "default" {
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "default"
      + password = (sensitive value)
      + project  = "<redacted>"
    }

  # module.postgresql-db.random_id.user-password will be created
  + resource "random_id" "user-password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.private-service-access.data.google_compute_network.main will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_network" "main"  {
      + description            = (known after apply)
      + gateway_ipv4           = (known after apply)
      + id                     = (known after apply)
      + name                   = "mysql-psql-example"
      + project                = "<redacted>"
      + self_link              = (known after apply)
      + subnetworks_self_links = (known after apply)
    }

  # module.private-service-access.google_compute_global_address.google-managed-services-range will be created
  + resource "google_compute_global_address" "google-managed-services-range" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "google-managed-services-mysql-psql-example"
      + network            = (known after apply)
      + prefix_length      = 16
      + project            = "<redacted>"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.private-service-access.google_service_networking_connection.private_service_access will be created
  + resource "google_service_networking_connection" "private_service_access" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "google-managed-services-mysql-psql-example",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.private-service-access.null_resource.dependency_setter will be created
  + resource "null_resource" "dependency_setter" {
      + id = (known after apply)
    }

  # module.safer-mysql-db.module.safer_mysql.google_sql_database.default will be created
  + resource "google_sql_database" "default" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "default"
      + project   = "<redacted>"
      + self_link = (known after apply)
    }

  # module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_5_6"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = "<redacted>"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = "ALWAYS"
          + authorized_gae_applications = []
          + availability_type           = (known after apply)
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + replication_type            = "SYNCHRONOUS"
          + tier                        = "db-n1-standard-1"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + start_time = (known after apply)
            }

          + ip_configuration {
              + ipv4_enabled    = (known after apply)
              + private_network = (known after apply)
              + require_ssl     = (known after apply)

              + authorized_networks {
                  + expiration_time = (known after apply)
                  + name            = (known after apply)
                  + value           = (known after apply)
                }
            }

          + location_preference {
              + zone = "us-central1-c"
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "stable"
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
          + update = "15m"
        }
    }

  # module.safer-mysql-db.module.safer_mysql.google_sql_user.additional_users[0] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "app"
      + password = (sensitive value)
      + project  = "<redacted>"
    }

  # module.safer-mysql-db.module.safer_mysql.google_sql_user.additional_users[1] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "readonly"
      + password = (sensitive value)
      + project  = "<redacted>"
    }

  # module.safer-mysql-db.module.safer_mysql.google_sql_user.default will be created
  + resource "google_sql_user" "default" {
      + host     = "cloudsqlproxy~%"
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "default"
      + password = (sensitive value)
      + project  = "<redacted>"
    }

  # module.safer-mysql-db.module.safer_mysql.random_id.user-password will be created
  + resource "random_id" "user-password" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_id.name: Creating...
random_id.name: Creation complete after 0s [id=JKs]
google_compute_network.default: Creating...
google_compute_network.default: Still creating... [10s elapsed]
google_compute_network.default: Creation complete after 17s [id=mysql-psql-example]
module.private-service-access.data.google_compute_network.main: Refreshing state...
google_compute_subnetwork.default: Creating...
module.private-service-access.google_compute_global_address.google-managed-services-range: Creating...
module.private-service-access.google_compute_global_address.google-managed-services-range: Creation complete after 8s [id=google-managed-services-mysql-psql-example]
module.private-service-access.google_service_networking_connection.private_service_access: Creating...
google_compute_subnetwork.default: Still creating... [10s elapsed]
module.private-service-access.google_service_networking_connection.private_service_access: Still creating... [10s elapsed]
google_compute_subnetwork.default: Still creating... [20s elapsed]
google_compute_subnetwork.default: Creation complete after 27s [id=us-central1/mysql-psql-example]
module.postgresql-db.google_sql_database_instance.default: Creating...
module.mysql-db.google_sql_database_instance.default: Creating...
module.private-service-access.google_service_networking_connection.private_service_access: Still creating... [20s elapsed]
module.private-service-access.google_service_networking_connection.private_service_access: Still creating... [30s elapsed]
module.private-service-access.google_service_networking_connection.private_service_access: Still creating... [40s elapsed]
module.private-service-access.google_service_networking_connection.private_service_access: Creation complete after 47s [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2F<redacted>%2Fglobal%2Fnetworks%2Fmysql-psql-example:servicenetworking.googleapis.com]
module.private-service-access.null_resource.dependency_setter: Creating...
module.private-service-access.null_resource.dependency_setter: Creation complete after 0s [id=8711503565126574834]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Creating...
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [10s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [20s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [30s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [40s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [50s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [1m0s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [1m10s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [1m20s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [1m30s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [1m40s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [1m50s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [2m0s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [2m10s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [2m20s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [2m30s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [2m40s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [2m50s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [3m0s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [3m10s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [3m20s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [3m30s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [3m40s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [3m50s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [4m0s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [4m10s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [4m20s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [4m30s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [4m40s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Still creating... [4m50s elapsed]
module.safer-mysql-db.module.safer_mysql.google_sql_database_instance.default: Creation complete after 4m53s [id=example-safer-mysql-24ab]
module.safer-mysql-db.module.safer_mysql.random_id.user-password: Creating...
module.safer-mysql-db.module.safer_mysql.google_sql_database.default: Creating...
module.safer-mysql-db.module.safer_mysql.random_id.user-password: Creation complete after 0s [id=ijqDHeS_Veo]
module.safer-mysql-db.module.safer_mysql.google_sql_user.default: Creating...
module.safer-mysql-db.module.safer_mysql.google_sql_user.additional_users[1]: Creating...
module.safer-mysql-db.module.safer_mysql.google_sql_user.additional_users[0]: Creating...
module.safer-mysql-db.module.safer_mysql.google_sql_database.default: Creation complete after 3s [id=example-safer-mysql-24ab:default]
module.safer-mysql-db.module.safer_mysql.google_sql_user.additional_users[0]: Creation complete after 4s [id=app/localhost/example-safer-mysql-24ab]
module.safer-mysql-db.module.safer_mysql.google_sql_user.default: Creation complete after 6s [id=default/cloudsqlproxy~%/example-safer-mysql-24ab]
module.safer-mysql-db.module.safer_mysql.google_sql_user.additional_users[1]: Creation complete after 10s [id=readonly/localhost/example-safer-mysql-24ab]

Error: Error, failed to create instance example-mysql-24ab: googleapi: Error 400: Invalid request: Non-routable or private authorized network (10.127.0.0/20).., invalid

  on ../../modules/mysql/main.tf line 27, in resource "google_sql_database_instance" "default":
  27: resource "google_sql_database_instance" "default" {



Error: Error, failed to create instance example-postgresql-24ab: googleapi: Error 400: Invalid request: Non-routable or private authorized network (10.127.0.0/20).., invalid

  on ../../modules/postgresql/main.tf line 33, in resource "google_sql_database_instance" "default":
  33: resource "google_sql_database_instance" "default" {


terraform apply  5.38s user 1.76s system 1% cpu 6:22.81 total
```
